{
  "episodes": [
    {
      "guid": "nc-links-2026-02-22",
      "title": "Links 2/21/2026",
      "description": "Daily Links from Naked Capitalism. 11 articles: Dog trained to illegally dump rubbish, Italian authorities say; The Cult Deprogrammer Who Needed Deprogramming; Biology’s New Era: The historic shift from studying life to engineering it; Plastic surgeon pumps more drama into ‘PenisGate’ at Olympics with injection claim; The latest skincare fad is rubbing salmon sperm on your face…",
      "audio_url": "https://connie817954.github.io/nakedcap-podcast/audio/nc-links-2026-02-22.mp3",
      "file_size": 32539851,
      "duration": "01:07:47",
      "pub_date": "2026-02-22T03:50:43.803381+00:00"
    },
    {
      "guid": "nc-links-2026-02-26",
      "title": "Links 2/26/2026",
      "description": "Daily Links from Naked Capitalism. 17 articles: How a Dog Mistaken for a Wolf Ended Up Running With Cross-Country Skiers at the 2026 Winter Olympics; Home Really Is Where the Heart Is; Chronic ocean heating fuels ‘staggering’ loss of marine life, study finds; Will Your State Bird Disappear?; These data center developers asked Trump for an exemption from pollution rules…",
      "audio_url": "https://connie817954.github.io/nakedcap-podcast/audio/nc-links-2026-02-26.mp3",
      "file_size": 52047820,
      "duration": "01:48:25",
      "pub_date": "2026-02-26T14:44:59.946752+00:00"
    },
    {
      "guid": "nc-links-2026-02-27",
      "title": "Links 2/27/2026",
      "description": "Daily Links from Naked Capitalism. 14 articles: Bad Stupid; US Government Is Accelerating Coral Reef Collapse, Scientists Warn; US ‘bullying’ could scupper carbon levy on shipping, warn experts; Extreme weather having an impact on farmers’ mental health; A hotter, wetter South is becoming a breeding ground for mold…",
      "audio_url": "https://connie817954.github.io/nakedcap-podcast/audio/nc-links-2026-02-27.mp3",
      "file_size": 37308748,
      "duration": "01:17:43",
      "pub_date": "2026-02-27T14:13:50.369377+00:00"
    }
  ]
}